//=============================================================================
//
// エネミーモデル処理 [ground.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_GROUND		(15)					// エネミーの数
#define	GROUND_SIZE		(5.0f)				// 当たり判定の大きさ
#define ROTATION_SPEED				(0.18f)

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct GROUND
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	int					state;
	bool				use;
	bool				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float				spd;				// 移動スピード
	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGround(void);
void UninitGround(void);
void UpdateGround(void);
void DrawGround(void);
